#+TITLE: Memoria
#+AUTHOR: Pedro Gómez Martín

#+LANGUAGE: spanish

#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage[a4paper, margin=2.5cm]{geometry}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[bottom]{footmisc}

#+LATEX_HEADER: \usepackage{amsmath}

#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usemintedstyle{solarized-light}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \restylefloat{figure}

#+LATEX_HEADER: \usepackage{endnotes}
#+LATEX_HEADER: \renewcommand{\footnote}{\endnote}

\setlength{\parskip}{0.5em}

\pagebreak
*** Cálculo de la proyección
En este bloque de código calculamos la proyección de $b$ sobre el
espacio de columnas de $A$:

#+name: figura-2
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-1>>
ans = A * res
#+end_src

#+RESULTS: figura-2
| 5.023809523809524 |
|                 3 |
| 1.785714285714286 |
| 1.380952380952381 |
| 1.785714285714286 |
|                 3 |
| 5.023809523809524 |

** Práctica
Para hallar el complemento ortogonal del subespacio plasmado en la
matriz $A$, primero tenemos que realizar la eliminación gaussiana en
la traspuesta de dicha matriz:

#+name: figura-7
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-1>>
m1 = transpose(A)
ans = transpose(A)
#+end_src

#+RESULTS[9d2ea67c926cbaeef1223e56a5d807289f410398]: figura-7
|  1 |  1 |  1 | 1 | 1 | 1 | 1 |
| -3 | -2 | -1 | 0 | 1 | 2 | 3 |
|  9 |  4 |  1 | 0 | 1 | 4 | 9 |

Una vez hecha la traspuesta, procedemos a hacer manualmente la
eliminación gaussiana. Para eso, tenemos que construir la matriz que
le vamos a restar a la matriz inicial. En la fila que vamos a usar
para calcular el resto ponemos todo 0, en las siguientes extraemos
la primera fila y la multiplicamos por el valor del escalar en la
primera columna de esa fila.

#+name: figura-8
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-7>>
m2 = m1 - [0 0 0 0 0 0 0; m1(1, :) * m1(2,1); m1(1,:) * m1(3,1)]
ans = m2
#+end_src

#+RESULTS[264004359bb215d57220cac6f3cc37526965d04d]: figura-8
| 1 |  1 |  1 |  1 |  1 |  1 | 1 |
| 0 |  1 |  2 |  3 |  4 |  5 | 6 |
| 0 | -5 | -8 | -9 | -8 | -5 | 0 |

Para la siguiente iteración del algoritmo, tanto la primera como la
segunda fila son puestas a cero y para la tercera fila repetimos el
proceso, pero esta vez con la segunda fila y el escalar en la segunda
columna.

#+name: figura-9
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-8>>
m3 = m2 - [0 0 0 0 0 0 0; 0 0 0 0 0 0 0; m2(2,:) * m2(3,2)]
ans = m3
#+end_src

#+RESULTS[6fcd6cfcc8451a58270a9f5f6c72a5771cb95e1a]: figura-9
| 1 | 1 | 1 | 1 |  1 |  1 |  1 |
| 0 | 1 | 2 | 3 |  4 |  5 |  6 |
| 0 | 0 | 2 | 6 | 12 | 20 | 30 |

Una vez tenemos la matriz $M_3$, que es la matriz $A$ a la que le
hemos aplicado la eliminación gaussiana, procedemos a resolver el
sistema $M_3 \cdot x = \vec{0}$:

#+name: figura-10
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-9>>
A = horzcat(m3(:,1), m3(:,2), m3(:,3))
X0 = [linsolve(A, m3(:,4)); 1; 0; 0; 0]
ans = X0
#+end_src

#+RESULTS[58c4fb606f79442788b47fbedc1cf771826b5377]: figura-10
|  1 |
| -3 |
|  3 |
|  1 |
|  0 |
|  0 |
|  0 |

#+name: figura-11
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-9>>
A = horzcat(m3(:,1), m3(:,2), m3(:,3))
X1 = [linsolve(A, m3(:,5)); 0; 1; 0; 0]
ans = X1
#+end_src

#+RESULTS[09a36cc9812c315136e516e48aa4a452239634b7]: figura-11
|  3 |
| -8 |
|  6 |
|  0 |
|  1 |
|  0 |
|  0 |

#+name: figura-12
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-9>>
A = horzcat(m3(:,1), m3(:,2), m3(:,3))
X2 = [linsolve(A, m3(:,6)); 0; 0; 1; 0]
ans = X2
#+end_src

#+RESULTS[2bbbd253b2bb3e3e4c5eaa725faa94659664f7cc]: figura-12
|   6 |
| -15 |
|  10 |
|   0 |
|   0 |
|   1 |
|   0 |

#+name: figura-13
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-9>>
A = horzcat(m3(:,1), m3(:,2), m3(:,3))
X3 = [linsolve(A, m3(:,7)); 0; 0; 0; 1]
ans = X3
#+end_src

Por lo tanto, el subespacio $U^{\perp}$ está compuesto por los
vectores que conforman la siguiente matriz:

#+name: figura-14
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-10>>
<<figura-11>>
<<figura-12>>
<<figura-13>>
ans = horzcat(X0, X1, X2, X3)
#+end_src

#+RESULTS[4fd2ca2242592dd5c5c0ef772e5082ef29569173]: figura-14
|  1 |  3 |   6 |  10 |
| -3 | -8 | -15 | -24 |
|  3 |  6 |  10 |  15 |
|  1 |  0 |   0 |   0 |
|  0 |  1 |   0 |   0 |
|  0 |  0 |   1 |   0 |
|  0 |  0 |   0 |   1 |

\pagebreak
** Práctica
Para hallar la matriz simplemente ejecutamos el código similar al
descrito anteriormente.

#+name: figura-15
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-4>>
<<figura-14>>
<<figura-1>>
M1 = horzcat(A, X0, X1, X2, X3)
M = eval(mat2str(M1 * P * inv(M1), 3))
ans = M
#+end_src

#+RESULTS[ffe0b8a6739928b8481dd751fd57eaa0e0bfac64]: figura-15
|  -1.39 |   0.905 |   2.89 |  -1.43 |  -1.23 |  -0.357 |    1.18 |
|  -1.34 |    1.31 |   1.32 |  -1.06 | -0.892 |  -0.244 |   0.884 |
| -0.182 | -0.0734 |  0.999 | -0.274 | -0.251 | -0.0734 |   0.259 |
| 0.0893 | -0.0952 | -0.204 |  0.476 |  0.339 |   0.151 | -0.0893 |
| -0.101 |  0.0317 |  0.113 |  0.476 |  0.308 |   0.167 |  0.0536 |
| -0.646 |   0.415 |   1.05 |  0.226 | 0.0466 |   0.129 |   0.473 |
|  -1.54 |    1.05 |    2.6 | -0.274 | -0.443 |  0.0377 |    1.17 |

Para hallar el vector que nos pide simplemente tenemos que multiplicar
el vector por $M$:

#+name: figura-16
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-15>>
b2 = [-9; 64; -33; 5; 0; 5; 10]
ans = M * b2
#+end_src

#+RESULTS[bc3cb4173440fc281a7469e4227bb7436c6d6fd0]: figura-16
|            -22.075 |
|  54.66000000000001 |
| -35.17359999999999 |
|  2.077499999999999 |
|             2.9598 |
|  4.228999999999997 |
|  5.778500000000005 |

\pagebreak
** Práctica
Con las conclusiones extraidas procedemos a encontrar los autovalores
de la matriz $P$.

Con la llamada a la función ~eig~ obtenemos la matriz $M$ y $S$
#+name: figura-17
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-15>>
[V,M,S] = eig(P)
ans = eval(mat2str(M, 3))
#+end_src

#+RESULTS[a314df31e3b8430e4d9c7105bcc9bf0f370e3e0e]: figura-17
| 1+0i | 0+0i                     | 0+0i                     | 0+0i                  | 0+0i | 0+0i                                       | 0+0i                                       |
| 0+0i | 2.775557561562891e-17+0i | 0+0i                     | 0+0i                  | 0+0i | 0+0i                                       | 0+0i                                       |
| 0+0i | 0+0i                     | 1.146653508998796e-16+0i | 0+0i                  | 0+0i | 0+0i                                       | 0+0i                                       |
| 0+0i | 0+0i                     | 0+0i                     | 0.9999999999999998+0i | 0+0i | 0+0i                                       | 0+0i                                       |
| 0+0i | 0+0i                     | 0+0i                     | 0+0i                  | 1+0i | 0+0i                                       | 0+0i                                       |
| 0+0i | 0+0i                     | 0+0i                     | 0+0i                  | 0+0i | 3.3448582039861e-17+3.037189565488916e-17i | 0+0i                                       |
| 0+0i | 0+0i                     | 0+0i                     | 0+0i                  | 0+0i | 0+0i                                       | 3.3448582039861e-17-3.037189565488916e-17i |

#+name: figura-17b
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-17>>
ans = eval(mat2str(S, 3))
#+end_src

#+RESULTS[5f30e18c3b1cf3c03875bd6e1980f42fa4790ef7]: figura-17b
| 0.708+0i   | 0.344+0i  | 0+0i      | 0+0i       | 0+0i     | 0+0i                        | 0+0i                        |
| 0.249+0i   | -0.596+0i | -0.345+0i | -0.225+0i  | 0.12+0i  | 0.0871+0.08019999999999999i | 0.0871-0.08019999999999999i |
| -0.0328+0i | 0.268+0i  | 0.627+0i  | -0.304+0i  | 0.231+0i | -0.07870000000000001-0.363i | -0.07870000000000001+0.363i |
| -0.137+0i  | -0.401+0i | -0.143+0i | -0.238+0i  | 0.336+0i | -0.322+0.458i               | -0.322-0.458i               |
| -0.0636+0i | 0.394+0i  | 0.116+0i  | -0.0273+0i | 0.432+0i | 0.5669999999999999+0i       | 0.5669999999999999+0i       |
| 0.187+0i   | 0.258+0i  | -0.587+0i | 0.329+0i   | 0.521+0i | -0.289-0.325i               | -0.289+0.325i               |
| 0.615+0i   | -0.267+0i | 0.331+0i  | 0.831+0i   | 0.602+0i | 0.0356+0.149i               | 0.0356-0.149i               |

Y con ~inv~ calculamos la inversa de $S$
#+name: figura-17c
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-17>>
S1 = inv(S)
ans = eval(mat2str(S1, 3))
#+end_src

#+RESULTS[a70028aed32e6f92df20d24b00653b486067714b]: figura-17c
| 1.08+3.38e-18i                 | 0.505-5.18e-18i  | 0.101-3.29e-18i              | -0.135+6.94e-18i | -0.202+0i        | -0.101-2.05e-18i | 0.168+1.99e-19i  |
| 0.6919999999999999-2.03e-17i   | -1.04+3.11e-17i  | -0.208+1.97e-17i             | 0.277-4.16e-17i  | 0.415+0i         | 0.208+1.23e-17i  | -0.346-1.19e-18i |
| -0.06569999999999999+2.94e-18i | -0.309-5.64e-18i | 0.6870000000000001-8.42e-19i | 0.0405+6.94e-18i | -0.165-3.47e-18i | -0.599+4.81e-20i | 0.411+2.4e-20i   |
| -0.506+3.41e-17i               | -0.605-3.4e-17i  | -0.59-6.54e-17i              | -0.459+5.55e-17i | -0.212+5.55e-17i | 0.149-5e-17i     | 0.626+4.39e-18i  |
| -0.204-8.81e-17i               | 0.201+1.17e-16i  | 0.474+1.18e-16i              | 0.613-1.67e-16i  | 0.618-5.55e-17i  | 0.491+8.28e-17i  | 0.23-7.58e-18i   |
| -0.108-0.321i                  | 0.33+0.427i      | -0.187+0.427i                | -0.352-0.608i    | 0.502-0.197i     | -0.2+0.299i      | 0.0152-0.0274i   |
| -0.108+0.321i                  | 0.33-0.427i      | -0.187-0.427i                | -0.352+0.608i    | 0.502+0.197i     | -0.2-0.299i      | 0.0152+0.0274i   |

\pagebreak
** Práctica
Podemos calcular una base de este subespacio con la función ~null~ de
MATLAB:
#+name: figura-18
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-4>>
ans = null(P)
#+end_src

#+RESULTS[1d142091a74acc20cd0a8f4cecc152a060bfd189]: figura-18
|  -0.1377491713487849 |   -0.1730823156848629 | -0.0305567977140812 |   0.4338538901503446 |
| -0.05811810969254662 | -0.008912290461406491 | 0.05950648540039829 |  -0.8410038935019881 |
|   0.7500305059015109 |    0.3162071610244604 |  0.0956956256784585 |   0.2063863683621036 |
|  -0.5244927703278465 |    0.3735108967850243 | -0.4728700346350329 |   0.1686936301927182 |
|   -0.279286057268284 |   -0.3324180166148261 |   0.707723461541584 |   0.1578314820139345 |
|   0.2490139784695076 |   -0.6374699548070523 | -0.4938109626094065 | -0.04539320144656525 |
| 0.000601624266443659 |    0.4621645197586631 |  0.1343122223380801 | -0.08036827577054763 |

Aquí podemos ver que la dimensión del subespacio es 4

\pagebreak
** Práctica
Para calcular $A^+$, primero tenemos que descomponer la matriz $A$ en
$F$ y $R$, la matriz $F$ es trivial, simplemente tenemos que coger las
dos primeras columnas de $A$ y para obtener $R$, que es
$r \times n - r = 2 \times 1$, tendremos que resolver el sistema
$FX=a_3$ donde $a_3$ es la tercera columna de $A$:
#+name: figura-19
#+begin_src octave :noweb strip-export :exports both :cache yes
A=[1,1,3; 1,4,6; 1,9,11; 1,16,18; 1,25,27]
F=[1 1; 1 4; 1 9; 1 16; 1 25]
a3=[3;6;11;18;27]
X = linsolve(F, a3)
ans = X
#+end_src

#+RESULTS[202fbc4a2acb6c2835e23a617275a1d1b9082a0f]: figura-19
| 1.999999999999993 |
|                 1 |

Por lo tanto, con el resultado anterior, obtenemos $R$:
#+name: figura-20
#+begin_src octave :noweb strip-export :exports both :cache yes
R = [1 0 2; 0 1 1]
ans = R
#+end_src

#+RESULTS[bde0d67961b9a71fbf1f92234b83aec1a894b047]: figura-20
| 1 | 0 | 2 |
| 0 | 1 | 1 |

Comprobamos como efectivamente $A=FR$
#+name: figura-21
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-19>>
<<figura-20>>
ans = F * R
#+end_src

#+RESULTS[c88d59cdbd94660d34a0d85b5b4cc62148ff2d23]:
| 1 |  1 |  3 |
| 1 |  4 |  6 |
| 1 |  9 | 11 |
| 1 | 16 | 18 |
| 1 | 25 | 27 |

Y ahora calculamos la matriz $P$
#+name: figura-22
#+begin_src octave :noweb strip-export :exports both :cache yes
<<figura-19>>
<<figura-20>>
P = R.' * inv(R * R.') * inv(F.' * F) * F.'
ans = eval(mat2str(P, 3))
#+end_src

#+RESULTS[73d024f466441b258d5fe2ebdd1e25572bd2f83b]: figura-22
|  0.174 |  0.142 |  0.0881 |   0.0132 | -0.0831 |
| -0.187 | -0.151 | -0.0907 | -0.00651 |   0.102 |
|   0.16 |  0.132 |  0.0854 |   0.0199 | -0.0643 |



\pagebreak
